# DivideVolumesProfilesForWidthAll Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivideVolumesProfilesForWidthAll Property
BuiltInFailures..::..DPartFailures Class See Also
---
Division family cannot be used for all widths of hosts
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivideVolumesProfilesForWidthAll { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivideVolumesProfilesForWidthAll As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivideVolumesProfilesForWidthAll {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace